#### GetFilter Method

---

|  |
| --- |
| ReferenceIntersector Class   See Also |

Gets the ElementFilter used in intersection testing.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementFilter GetFilter() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetFilter As ElementFilter ``` |

| Visual C++ |
| --- |
| ``` public: ElementFilter^ GetFilter() ``` |

#### Return Value

The ElementFilter, or    a null reference (  Nothing  in Visual Basic)  if no filter is set.

# See Also

ReferenceIntersector Class

Autodesk.Revit.DB Namespace